[
    {
      "status": "Accepted",
      "applicationDate": "01/19/2021",
      "decisionDate": "04/23/2021",
      "education": {
        "institution": "Big State School",
        "degrees": [
          {
            "degree": "BS in Computer Engineering",
            "gpa": 3.35
          },
          {
            "degree": "MS in Software Engineering",
            "gpa": 4.0
          }
        ]
      },
      "recommendations": 0,
      "experience": "Unrelated(Active Duty Air Force), open source projects",
      "statementOfPurpose": "Y",
      "comments": "All A's for prereq's, including the ones on the math prep form."
    },

    {
      "status": "Accepted",
      "applicationDate": "12/28/2020",
      "decisionDate": "04/08/2021",
      "education": {
        "institution": "University of Minnesota",
        "degrees": [
          {
            "degree": "BS in Computer Engineering",
            "gpa": 3.22
          },
          {
            "degree": "MS in Computer Science",
            "gpa": 3.7
          },
          {
            "degree": "Santa Clara University"
          }
        ]
      },
      "recommendations": 1,
      "experience": "3 years as machine learning engineer, 3 years as software engineer.",
      "statementOfPurpose": "Y",
      "comments": "I also have publications and thesis. Generally I think I deserve it with all prerequisites with A or A-."
    },

    {
      "status": "Rejected",
      "applicationDate": "01/12/2021",
      "decisionDate": "05/10/2022",
      "education": {
        "institution": "University of Illinois",
        "degrees": [
          {
            "degree": "BS Mechanical Engineering",
            "gpa": 3.75
          }
        ]
      },
      "recommendations": 1,
      "experience": "3 years, manufacturing, Python & SQL",
      "statementOfPurpose": "Y",
      "comments": "Got rejected, but I've already accepted an admission offer for GT OMSA, so I'm not overly bothered."
    },

    {
      "status": "Accepted",
      "applicationDate": "02/02/2021",
      "decisionDate": "04/08/2021",
      "education": {
        "degrees": [
          {
            "institution": "BS Health Sciences"
          },
          {
            "institution": "MPH"
          }
        ]
      },
      "recommendations": 3,
      "experience": "5 years in research in academia which involved some stats",
      "statementOfPurpose": "Y",
      "comments": "Nervous and will need to do a lot of studying in maths/programming before Fall!"
    },

    {
      "status": "Accepted",
      "applicationDate": "03/18/2021",
      "decisionDate": "04/23/2021",
      "education": {
        "institution": "UT Austin",
        "degrees": [
          {
            "degree": "BS Data Science",
            "gpa": 3.92
          }
        ]
      },
      "recommendations": 3,
      "experience": "No relevant experience.",
      "statementOfPurpose": "Y",
      "comments": "My Weakness - I know my 3.92 GPA seems like a good one, however, my community college GPA is not as great (3.2). My current school was very generous with the amount of hours I was able to transfer so I have only been at my 4-year university for a year and a half.\n\nMy Strengths - It seems like this program has a high acceptance rate among students who have a degree in statistics/data science with at least a descent GPA."
    },

    {
      "status": "Accepted",
      "applicationDate": "01/29/2021",
      "decisionDate": "04/08/2021",
      "education": {
        "degrees": [
          {
            "institution": "Korea Military Academy",
            "degree": "BS in Physics",
            "gpa": 2.92
          },
          {
            "institution": "Texas A&M University",
            "degree": "MS in Nuclear Engineering",
            "gpa": 4.0
          }
        ]
      },
      "toeflScore": {
        "total": 105,
        "listening": 29,
        "reading": 29,
        "speaking": 22,
        "writing": 25
      },
      "recommendations": 3,
      "experience": "Unrelated(Active Duty Korean Army). Applied python for MS research.",
      "statementOfPurpose": "Y"
    },

    {
      "status": "Accepted",
      "applicationDate": "03/19/2021",
      "decisionDate": "06/01/2021",
      "education": {
        "institution": "UT Austin",
        "degrees": [
          {
            "degree": "BS in Computer Science and Mathematics",
            "gpa": 3.28
          }
        ]
      },
      "gre": {
        "quantitative": 169,
        "verbal": 154,
        "writing": 5.0
      },
      "recommendations": 3,
      "experience": "1 month internship in SparkCognition as an Engineering Intern (involves NLP (Natural Language Processing)); will include CV in application once MyStatus opens up for me",
      "statementOfPurpose": "Y",
      "comments": "My GPA is kind of ~meh~ due to personal issues during some of my undergraduate career (which I will definitely elaborate in my SoP), but I do hope that my strong (IMO) background (even though I haven't had data science industry experience yet) will make it up for it: coding experience in Java, C++, Python, and R; strong grades in the prerequisite courses (A's and one A- in multivariable calculus lol); several Coursera certificates in Data Science; participation in the Directed Reading Program under the Mathematics department and the Computer Science department where I did projects in Statistics, Machine Learning, and Applied Linear Algebra, experience as an undergraduate research assistant volunteer for one of my grad school friends involving AI/Machine Learning, and even several side projects in Python involving linear regression and correlation. I am also applying to other programs, both online and on-campus, as well."
    },

    {
      "status": "Accepted",
      "applicationDate": "03/29/2021",
      "decisionDate": "05/10/2021",
      "education": {
        "institution": "Big State School",
        "degrees": [
          {
            "degree": "BS in Electrical Engineering",
            "gpa": 3.4
          }
        ]
      },
      "recommendations": 2,
      "experience": "4 years in application engineering and tech sales at a data acquisition/insight company",
      "statementOfPurpose": "Y",
      "comments": "Humbled last Fall when I applied for Spring 2021. Self-taught Python by doing personal data analytics projects the past 6 months, cleaned up my statement of purpose and CV significantly, fingers crossed!"
    },

    {
      "status": "Accepted",
      "applicationDate": "08/31/2020",
      "decisionDate": "10/23/2020",
      "education": {
        "degrees": [
          {
            "institution": "SUNY Oswego",
            "degree": "B.A. Mathematics",
            "gpa": 3.3
          },
          {
            "institution": "Virginia Tech",
            "degree": "M.S. Statistics",
            "gpa": 3.1
          }
        ]
      },
      "gre": {
        "quantitative": 160,
        "verbal": 161,
        "writing": 4.5
      },
      "recommendations": 2,
      "statementOfPurpose": "Y",
      "comments": "I'm noticing a trend of people that almost seem overqualified being rejected. I was accepted with very little relevant experience other than my decade-old degrees. I can only assume I convinced them with my statement of purpose and recommendations."
    },

    {
      "status": "Accepted",
      "applicationDate": "02/16/2021",
      "decisionDate": "04/08/2021",
      "education": {
        "degrees": [
          {
            "institution": "Queen's University at Kingston",
            "degree": "Bachelor of Science in Biology",
            "gpa": 3.4,
            "scale": 4.3
          },
          {
            "institution": "KU Leuven",
            "degree": "Master of Science in Bioinformatics",
            "partialCompletion": true,
            "gpa": 13,
            "scale": 20
          }
        ]
      },
      "recommendations": 0,
      "experience": "3.5 years of data analysis and analytics in bioinformatics. Currently a bioinformatics data analyst at a public health agency in Canada working on COVID-19",
      "statementOfPurpose": "Y",
      "comments": "I believe that my SOP and professional experience really helped with my admission to the program, as I stressed my current experience in bioinformatics and wanting to work in data science with a public health focus. My bachelor GPA was low for the first couple of years, but I had a 3.81 in the final two years and a 4.13 in my final year. Also did a partial completion of a master's program in Belgium in bioinformatics before COVID hit where I did all the mathematics, statistics, and programming course requirements. My grades were average (13/20), but the program is extremely challenging; we do 13 courses in year 1 over the span of 8 months and got to produce some very technical data science projects from it. Additionally, I have a very active GitHub account with coding projects in R, Python, bash, Java, etc from both studies and employment."
    },

    {
      "status": "Accepted",
      "applicationDate": "02/20/2021",
      "decisionDate": "04/23/2021",
      "education": {
        "institution": "Large State School in Texas",
        "degrees": [
          {
            "degree": "BS in Engineering",
            "gpa": 3.5
          }
        ]
      },
      "recommendations": 3,
      "experience": "3 years in drilling in oil and gas, one programming class in python at a local college (in progress), post graduate program in AI and ML with UT (in progress)",
      "statementOfPurpose": "Yes",
      "comments": "Happy to be accepted! Can't wait to start the class! If anyone in the Houston area wants to connect, please feel free to message me. Any advice is welcome!"
    },

    {
      "status": "Accepted",
      "applicationDate": "03/26/2021",
      "decisionDate": "05/10/2021",
      "education": {
        "institution": "University of Utah",
        "degrees": [
          {
            "degree": "BS Mathematics - Statistics emphasis",
            "gpa": 3.4
          }
        ]
      },
      "recommendations": 3,
      "experience": "None. My analytics/statistics experiences are 100% undergrad (R, SAS, SPSS, some Java) and beginner level self-taught coding and other programs (Python, SQL, Tableau)",
      "statementOfPurpose": "Y",
      "comments": "For my statement, I actually wrote about how I struggled in undergrad due to some really bad mental health issues I had pretty severely at the time (I still have them, but they're more manageable now). I talked about how after graduating (literally graduated at the start of the pandemic, so job hunting was such a nightmare and I'm currently looking for new job opportunities more relevant to the analytics field), I dedicated myself to keeping fresh all the stuff I learned in school and ultimately became much stronger at stats, probability, calculus, probability distributions, etc than I ever was during my undergraduate degree. I talked about how I started to self-teach myself stuff like Python and SQL. I talked about overcoming those struggles and obstacles to try to improve myself and having confidence in my ability to continue to do so in graduate school. IDK what impact my statement had on their decision, but I was happy I was honest about having struggles, but overcoming them anyway. I also was honest that my math/stats background is much stronger than my technical/programming background, so I hope to use this data science degree as an opportunity to greatly strengthen my technical skills."
    },

    {
      "status": "Accepted",
      "applicationDate": "01/09/2021",
      "decisionDate": "05/10/2021",
      "education": {
        "degrees": [
          {
            "institution": "University of Illinois Urbana-Champaign",
            "degree": "MBA",
            "gpa": 3.97
          },
          {
            "institution": "Georgia Institute of Technology",
            "degree": "MS CS",
            "gpa": 3.8
          },
          {
            "institution": "Unknown European University",
            "degree": "MSE Informatics"
          }
        ]
      },
      "toeflScore": {
        "total": 109,
        "reading": 29,
        "listening": 29,
        "speaking": 22,
        "writing": 25
      },
      "recommendations": 1,
      "experience": "10+ years, VP of SW Engineering at a large private US corp",
      "statementOfPurpose": "Y",
      "comments": "Also applied to Stanford SCPD HCP for Deep Learning"
    }
]  