[{"status": "Rejected", "applicationdate": "not sure", "decisiondate": "5/11/2021", "education": "Small private school. Double major Finance & Data Analytics. Minor in CS. GPA: 3.3", "recommendations": "3. 2 managers 1 CS professor.", "experience": "4.5 year in analytics consulting. Have worked for FAANGS, crypto, and fin tech.", "statementofpurpose": "Y", "comments": "second time denied. Gonna do OMSCS (was my first option anyway). Just wanted to give back to community for some data on rejects. Not sure where my app went wrong. Good luck to all! 👍🏼"}, {"status": "Accepted", "applicationdate": "1/19/2021", "forwardedtograduatecommitteeforreview": "~3/17/2021", "decisiondate": "4/23/2021", "education": "Big State School, BS in Computer Engineering 3.35, MS in Software Engineering 4.0", "grescores(q,v,w)": "0", "recommendations": "0", "experience": "Unrelated(Active Duty Air Force), open source projects", "statementofpurpose": "Y", "comments": "All A's for prereq's, including the ones on the math prep form."}, {"status": "Accepted", "applicationdate": "12/28/2020", "forwardedtograduatecommitteeforreview": "~3/1/2021", "decisiondate": "4/8/2021", "education": "U Minnesota, BS in Computer Engineering 3.22, MS in Computer Science 3.7, Santa Clara University", "grescores(q,v,w)": "0", "recommendations": "1 from industry", "experience": "3 years as machine learning engineer, 3 year as software engineer.", "statementofpurpose": "Y", "comments": "I also have publications and thesis. Generally I think I deserve it with all pre-requisites with A or A-."}, {"status": "Accepted", "applicationdate": "02/02/2021", "decisiondate": "04/08/2021", "education": "BS Health Sciences; MPH", "grescores(q,v,w)": "0", "recommendations": "3", "experience": "~5 years in research in academia which involved some stats", "statementofpurpose": "Y", "comments": "Nervous and will need to do a lot of studying in maths/programming before Fall!"}, {"status": "Accepted", "applicationdate": "03/18/2021", "forwardedtograduatecommitteeforreview": "3/20/2021", "decisiondate": "04/23/2021", "education": "BS Data Science, 3.92 (This is my last semester)", "grescores(q,v,w)": "Waived", "recommendations": "3 (1 Professional, 2 Academic)", "experience": "No relevant experience.", "statementofpurpose": "Y", "mythoughts": ""}, {"status": "Accepted", "applicationdate": "1/29/2021", "forwardedtograduatecommitteeforreview": "~2/22/2021", "decisiondate": "4/8/2021", "education": "Korea Military Academy, BS in Physics, 2.92", "grescores(q,v,w)": "0", "toeflscore": "105 (29,29,22,25)", "recommendations": "3 from academic", "experience": "Unrelated(Active Duty Korean Army). Applied python for MS research.", "statementofpurpose": "Y", "comments": "."}, {}, {"status": "Accepted", "applicationdate": "3/19/2021", "forwardedtograduatecommitteeforreview": "~4/20/2021", "decisiondate": "6/1/2021", "education": "UT Austin, BS in Computer Science and Mathematics, 3.28 (double major in progress)", "grescores(q,v,w)": "169, 154, 5.0", "recommendations": "3 (they all seem pretty good so far based on my admissions results so far)", "experience": "1 month internship in SparkCognition as an Engineering Intern (involves NLP (Natural Language Processing)); will include CV in application once MyStatus opens up for me", "statementofpurpose": "Y", "comments": "My GPA is kind of ~meh~ due to personal issues during some of my undergraduate career (which I will definitely elaborate in my SoP), but I do hope that my strong (IMO) background (even though I haven't had data science industry experience yet) will make it up for it: coding experience in Java, C++, Python, and R; strong grades in the prerequisite courses (A's and one A- in multivariable calculus lol); several Coursera certificates in Data Science; participation in the Directed Reading Program under the Mathematics department and the Computer Science department where I did projects in Statistics, Machine Learning, and Applied Linear Algebra, experience as an undergraduate research assistant volunteer for one of my grad school friends involving AI/Machine Learning, and even several side projects in Python involving linear regression and correlation. I am also applying to other programs, both online and on-campus, as well.", "***update": "FINALLY accepted after a bit over 2 months lmao, but won't be attending since I already committed to another Masters program. Honestly and pleasantly surprised tbh. :3***"}, {"status": "Accepted!", "applicationdate": "3/29/2021", "forwardedtograduatecommittee": "4/5/2021", "decisiondate": "5/10/2021", "education": "Big State School, BS in Electrical Engineering, 3.4", "grescores(q,v,w)": "Waived", "recommendations": "2 (1 professional, 1 academic)", "experience": "4 years in application engineering and tech sales at a data acquisition/ insight company", "statementofpurpose": "Y", "comments": "Humbled last Fall when I applied for Spring 2021. Self-taught Python by doing personal data analytics projects the past 6 months, cleaned up my statement of purpose and CV significantly, fingers crossed!"}, {"status": "Rejected", "applicationdate": "09/14/2020", "decisiondate": "11/04/2020", "education": "State University, BS, Petroleum Engineering, 3.4 w/minors in Business, Technical Sales, and Geology", "grescores(q,v,w)": "Waived", "recommendations": "3", "experience": "3 years as Software Engineer at Fortune 15 energy company", "statementofpurpose": "Y", "comments": "Was very surprised of my rejection to the program - must have been super competitive. I might have lacked formal CS pre-reqs but had stated I completed them via MOOCs. Guess UT is looking for formal coursework to suffice as pre-reqs. Looking forward to applying next cohort!"}, {"status": "Rejected", "applicationdate": "09/01/2020", "decisiondate": "11/04/2020", "education": "MBA,PhD big ten school in quantitative field; MPH Harvard", "grescores(q,v,w)": "Waived", "recommendations": "0", "experience": "Python, R, tons of stats courses from my past education, over 10 years of experience in business analytics leadership, worked in 3 major industries", "statementofpurpose": "Y", "comment": "Honestly I wasn’t expecting to be rejected. I am looking for a way to get some formal data science training. Meanwhile I think I have tons of valuable industrial experience to share with me peers, as well as learning from them. In the email I got, they said no feedback would be provided. I am moving on to Georgia Tech or University of Michigan next year, maybe."}, {"status": "Accepted", "applicationdate": "08/17/2020", "decisiondate": "10/23/2020", "education": "Public University, BS, Mathematics, 3.0", "grescores(q,v,w)": "Waived", "recommendations": "2", "experience": "No related experience", "statementofpurpose": "Y"}, {"status": "Rejected", "applicationdate": "9/8/2020 application, 9/15/2020 recommendations in", "decisiondate": "11/9/2020? I didn't get an email, i just checked the status page this morning", "education": "Math & English BA, minor CS state school, 2.7; unrelated MS, 3.4", "grescores(q,v,w)": "168, 169, 4.5", "recommendations": "3", "experience": "ten years, last three in tech doing rogue data analysis occasionally because it's not actually my job but I work with data. Years of experience with Python, some R recently.", "statementofpurpose": "Y", "comments": "I've completed ML, NLP, and statistics MOOCs and I included links to a data-scraping project. Pretty pissed I waited two months and they can't bother sending an email. I also emailed them questions a while ago and never got a response edit: got the email rejection a few hours later"}, {"status": "Rejected", "applicationdate": "09/20/2020 (submitted last document 10/15/2020)", "decisiondate": "11/04/2020", "education": "Canadian university, Bachelor in Accounting (3.64), Master in Accounting (3.3)", "grescores(q,v,w)": "Waived", "recommendations": "0", "experience": "4 years at a big 4 accounting firm, IT/business process audit and data assurance", "statementofpurpose": "Y", "comments": "I didn't really meet the pre-reqs and don't have much programming experience, so I could've been rejected for lack of technical background."}, {"status": "Accepted", "applicationdate": "09/14/2020", "decisiondate": "11/04/2020", "education": "University of Washington, BS, Electrical Engineering, 3.5", "grescores(q,v,w)": "waived", "recommendations": "0", "experience": "1-1/2 Years, Hardware Engineer", "statementofpurpose": "Y, it was a little less than one page, and was pretty shallow imo, I just talked about why I think math and stats is cool and the careers I'm interested in. I didn't do that whole story building garbage that a lot of people seem to do.", "comments": "I wasn't going to post about my profile, because I assumed nearly everyone would get in, but I'm seeing some highly qualified people (more qualified than me) being rejected, so I wanted to post to help people build an idea as to what the heck Austin may be looking for. I'm going to list some other things about my profile that may or may not be relevant:"}, {"status": "ACCEPTED", "applicationdate": "8/29/2020", "decisiondate": "10/23/2020", "education": "Small Liberal Arts School, BS, Applied Mathematics, Mathematical Economics, 3.45", "grescores(q,v,w)": "N/A", "recommendations": "3; Actuary (co-worker), Chief Actuary (boss), Chief Operating Officer", "experience": "4 years at publicly traded insurance company; 2 years as an underwriter, 2 years as an actuary", "statementofpurpose": "Y", "comments": "I have also completed a number of insurance industry designations / professional exams. Really hoping I get in to UT Austin. I'm between this and the OMSA at Georgia Tech. Good luck to y'all!"}, {"status": "Rejected", "applicationdate": "09/15/2020", "decisiondate": "11/9/2020", "education": "Large State School, BS, MIS, 3.3", "grescores(q,v,w)": "162, 159, 4.0", "recommendations": "3 (all professional)", "experience": "1.5 years, Jr Data Scientist at large media company, Python and some R", "statementofpurpose": "Y", "comments": "My biggest worry is that I’m not very strong on some of the prereqs. Had to work a lot through most of my undergrad to pay for school and was pretty involved in student government so sometimes my grades weren’t stellar. This is my #1 choice so I’m hoping they pay more attention to my strengths like my undergrad research experience. Good luck everyone!", "update": "Not that surprised that I didn’t get in, a lot of more qualified people were rejected. More surprised that it took 2 months to get a response."}, {}, {}, {"status": "Accepted", "applicationdate": "03/28/2022", "decisiondate": "05/09/2022", "education": "5 years bachelor of medicine, 6 years M.D/ph.d. (Both From Abroad). I don’t know about My undergraduate gpa, it’s a different system, we use 100 score scale, probably 3.0 gpa if calculated. My M.D/ Ph.d gpa is 3.75.", "grescores(q,v,w)": "not submitted", "recommendations": "1, from my postdoc PI (principle investigator)", "experience": "received 2 years postdoc training in research lab in USA, worked 2 years in hospital (abroad) as a doctor.", "statementofpurpose": "Tell my story about my 13 years education/ working experience in medical field, why I want to pursue the degree in data science.", "moocs": "0", "comments": "I feel so grateful to be admitted, with irrelevant major background, not outstanding GPA for undergraduate, and also 7 years gap being a stay-at-home mom. I think my M.D. / Ph.d degree might help me a lot. And also I did a lot of statistics when working as a postdoc in the lab. No computer programming background at all. I spent 10+ days working on the purpose of statement, English is my second language, and it was my very first time writing a SOP, I took it very seriously."}, {"status": "Rejected", "applicationdate": "01/23/2022", "decisiondate": "5/24/2022", "education": "BS Physics, BS Astronomy/Astrophysics, BA Mathematics, GPA=3.2", "grescores": "(154,154,3.5)", "recommendations": "2", "experience": "3 years as a data scientist for large tech company", "statementofpurpose": "Want a better understanding of principles behind ds through formal education.", "moocs": "0", "comments": "I write python for ml/ds everyday. I understand gpa/gre scores are not that high but I am honestly surprised (and upset) by this decision. It does not help that UT will not give a reason in the rejection email or on the mystatus website."}, {"status": "Accepted", "applicationdate": "12/27/2021", "decisiondate": "3/8/2022", "education": "BS Actuarial Math, GPA 3.5, FCAS (Fellow of the Casualty Actuarial Society)", "gre": "Not submitted", "recommendations": "0", "experience": "9 years as an Actuary", "statementofpurpose": "Explained how my career as an actuary set me up to succeed as a data scientist should I want to pursue a career outside insurance", "comments": "Decent GPA but my strong math background likely helped me get in. A lot of experience with R but wish I had more programming skills."}, {"status": "Accepted", "applicationdate": "04/18/22", "decisiondate": "06/06/22", "education": "Ivy League, BA History, 3.5", "grescores(q,v,w)": "170, 169, 5.0", "recommendations": "2 (both professional, though one is a humanities PhD)", "experience": "9 years, military, non-data position", "statementofpurpose": "Addressed 4 major topics - 1. Why I want to switch to data science, 2. What I've done to get myself ready from a non-traditional background (including what I think is an honest assessment of here I am and the topics I still need to work on), 3. How I think I can benefit the program with my background, 4. Why I'm interested in the UT program specifically.", "moocs": "Too many to count. I used MOOCs for all of my prereqs other than multivariable calculus. Also did Google Data Analyst Professional Certificate and 1st 5 courses of Johns Hopkins Data Science Specialization on Coursera.", "comments": "I definitely don't fit the traditional mold for this program, but I tried to explain my goals and show that I'm willing to put in the effort to reach them. I started taking MOOCs during lockdown in 2020, so I've been working toward this for a couple of years now. I suspect my GRE score was a major factor - the admissions site says it's especially helpful for those without a related degree and those who have been out of school for a long time, both of which apply to me."}, {"status": "Accepted", "applicationdate": "02/07/2022", "decisiondate": "05/06/2022", "education": "Columbia University, BS in applied mathematics, 3.2", "grescores(q,v,w)": "NULL", "recommendations": "2", "experience": "2 engineering internships", "statementofpurpose": "Data science fits my background, UT is a strong program, and I want to have a career in data science.", "moocs": "0", "comments": "University name recognition"}, {"status": "Accepted", "applicationdate": "03/14/2022", "decisiondate": "05/07/2022", "education": "UT Austin, BS, Mathematics 3.38 / 4.00", "grescores(q,v,w)": "N/A", "recommendations": "2", "experience": "6 months as a research analyst at an insurance company", "statementofpurpose": "Explained how I shifted career interests from actuarial science to data science", "moocs": "0", "comments": "Will most likely attend GT OMSA Fall 2022, though it's a difficult decision since UT's program looks great too. I was a little nervous about admissions due to my limited programming knowledge and no relevant experience. However, my strong mathematical foundation helped my application (and attending UT for undergrad lol)."}, {"status": "Recommended for admission", "applicationdate": "04/30/2022", "decisiondate": "6/6/2022", "education": "liberal arts bachelor from abroad; Masters in Econ (focused on econometrics) and masters in Publix admin from US. Non degree CS intro courses at OSU.", "grescores(q,v,w)": "not submitted", "recommendations": "not submitted", "experience": "a few years at a top consulting firm, then moved onto FAANG first in finance, now in data analytics", "statementofpurpose": "Emphasize my lifelong learning passion, changes to open my network to students in the cohort, and make you for the fact I was discouraged from going into STEM for undergrad as it make dominated 15 years ago in my developing country", "moocs": "0", "comments": "My scores at OSU are bad, so I’m afraid they’ll keep me out"}, {"status": "Accepted", "applicationdate": "03/06/2022", "decisiondate": "05/09/2022", "education": "UT Austin, BS in Film, BS in EE, BS in Math, and a Computational Science and Engineering Certificate, GPA 3.86", "grescores(q,v,w)": "0", "recommendations": "0", "experience": "Unemployed since kindergarten, but have research internships here and there", "statementofpurpose": "I like computer graphics, and data-driven methods seem pretty interesting for computer graphics researches", "moocs": "0", "comments": "Pretty much submitted a minimalism application"}, {"status": "Accepted", "applicationdate": "3/30/2022", "decisiondate": "5/09/2022", "education": "BS Physics, Minor in Mathematics at University of Illinois at Urbana-Champaign 3.69/4.00", "grescores(q,v,w)": "178,180,4.5", "recommendations": "0", "experience": "T2 tech support 1 year, great job not super relevant to data science though.", "statementofpurpose": "Described education, why I wanted to change careers, my exposure to machine learning, and my life story of how I ended up working where I work. I focused on the skills I gained at each job and my motivations for applying to new ones.", "moocs": "Andrew Ng's machine learning course, don't think I mentioned it in my application.", "comments": "I don't have a strong background in computer science, but I have taken advanced mathematics courses and had all A's or A-'s for their required courses."}, {}, {"status": "Accepted", "applicationdate": "06/15/2021", "decisiondate": "10/6/2021", "education": "Ivy league, BA in CS, >3.5", "grescores(q,v,w)": "168, 158, 4", "recommendations": "3Experience: ~2 year analytic work (not data data science, more of like academic fellowship)", "statementofpurpose": "Y", "comments": "This was my top choice due to a bit more recency and program selectivity, as well as really nice tuition package. I also got accepted into GaTech but would probably choose this one as the curriculum for this program seems to be a lot more rigorous and where I want to develop (data science). Let me know if anyone else is also considering between GaTech and UT Austin. Would love to have a discussion on this"}, {}, {"littlestatsfrompast2semesters": "", "turnaroundtimeforspring2021(prioritydeadline": "09/15/20 Regular 10/15/20 )", "meanturnaroundtimeisabout50days,withsdataround10dayssoifpriorityapplicationwassubmittedbetween08/07/21to08/15/21,theexpecteddecisiondateshouldberightaroundthisweekintonextweekbutonebigcaveat": "deadlines last year was extended for one month due to covid, resulting in Graduate Committee having a Thanksgiving deadline to beat. But there's no such concern this year, would the Committee take it slower in their decisions this semester?"}, {"status": "Accepted", "applicationdate": "07/16/2021", "decisiondate": "10/06/2021", "education": "University of Northern Iowa, BA in Quantitative Economics, 3.68", "grescores(q,v,w)": "N/A", "recommendations": "0", "experience": "2 years, Research Analyst at university, R, SPSS, Python", "statementofpurpose": "Y", "comments": "Obviously happy with results. I feel like my undergrad background in math and economics really helped (Discrete and argumentative math, econometrics, forecasting, applied mathematics in economics, fundamentals of data mining, as well as pre-reqs). I've also been doing research at the university for 5 years (3 as a student, and 2 full-time). Looking forward to the start of classes!"}, {}, {}, {"status": "Accepted", "applicationdate": "06/27/2021", "decisiondate": "10/06/2021", "education": "Texas A&M Central Texas, BS in Computer Science, 3.12", "grescores(q,v,w)": "NA", "recommendations": "3", "experience": "Office manager for almost a decade with some Excel and data cleaning exp. Not much else.", "statementofpurpose": "Y", "comments": "I included in my statement of purpose that I dropped out of college after high school and emphasized how my life experience has taught me how to be a successful student and earn BA in Comp Sci summa cum laude (institutional GPA was 3.9) over ten years later. I also included how my course work in Numerical Analysis and subsequent love of Python prompted me to want to pursue a higher degree in data. I was able to convince my Numerical Analysis, Linear Programming professor and head of Comp Sci Dept. to write letters of recommendation, but I don't know how much the committee values them."}, {"status": "Accepted", "applicationdate": "07/20/21", "decisiondate": "11/01/21", "education": "", "grescores(q,v,w)": "NA", "recommendations": "0", "experience": "No Professional Experience in Programming", "statementofpurpose": "Y", "comments": "I was filling pessimistic after getting rejected from MSCSO. I am very excited to get started"}, {}, {"status": "Admitted / Accepted", "applicationcompletiondate": "03/20/2023", "decisiondate": "05/23/2023", "education": "UH - Bachelor in MIS - 3.9", "gre": "N/A", "recommendation": "2 (1 from Director, 1 from former SM)", "exp": "1 year (DE, non-DS)", "sop": "talk about my passion with data and how I will apply DS into my current position work", "relevantcourses/moocs": "pre-reqs sastified by college, sql/python at work"}, {}, {"status": "Admitted Application Date: 04/20/2023 Decision Date: 05/26/2023 Education: BS in Actuarial Science (Top university in my country, not as high in world rankings) GRE: NA Recommendation: 0 Experience: 6 years in statistics related field Note: Felt pretty confident during the Quest Assessment and had a strong Toefl"}, {"status": "Accepted", "applicationdate": "2/6/2023", "decisiondate": "4/10/2023", "education": "BA and MA from great schools but unrelated topic (international relations esque)", "gre": "didn’t submit, did it for my first masters and didn’t want to again", "lettersofrec": "none", "experience": "2 years business/data analyst, 1 year data science manager", "sop": "Talked about how my direction started different but the goals and love of understanding truth and data have always been there. Explained my journey and courses taken", "moocs": "Lots. Some of the MITx Micromasters in statistics and data science, Linear Algebra, R, lots of Python"}, {"status": "Accepted", "applicationdate": "4/2/2023", "decisiondate": "05/31/2023", "education": "Liberal Arts College in Iowa, BA in Accounting and Actuarial Science", "grescores(q,v,w)": "N/A", "recommendations": "3", "experience": "4 years in auditing, building data analytics testing. CPA certified as of March 2023", "statementofpurpose": "talked about how data has propelled my career and continued growth will require more education in data analytics and data science", "relevantcreditcourses/moocs": "Actuarial Science covered advanced mathematics (linear algebra, multi variable calc, etc), limited experience in Python and C++ so I have been self-teaching from friends textbooks and UDemy, and taken courses in RPA from UiPath"}, {"status": "Accepted", "applicationdate": "5/1/23", "decisiondate": "6/15/23", "education": "UT Austin, BBA MIS, minors in CS and math, 3.73", "experience": "Big 4 IT consulting, NLP startup role, ML intern in helicopter company, tutoring at UT", "grescores(q,v,w)": "162, 160, 4", "recommendations": "3", "sop": "NLP-focused impact in business", "coursework": "Satisfied programming and math requirements through UT coursework", "comments": "Hook ‘em. Best of luck to all those who got in. If you didn’t hear back don’t fret. I heard the latest July 1 is when they will announce."}, {"status": "admitted planning to accept", "applicationdate": "4/25/23", "decisiondate": "5/31/23", "education": "UH, BS Petroleum 2.91 GPA GRE: N/A", "recommendations": "3 solid recommendations", "experience": "4.5 years non DS with moderate programming side projects", "sop": "talked about successes in innovative process improvement projects leading to financial savings. Experience in some programming", "relevantcoursework": "one online Intro to CS course from accredited university"}, {"status": "Admitted", "applicationdate": "04/15/2023", "decisiondate": "05/23/2023", "education": "(Top 15 Public University) BS in Supply Chain Management, 3.5, MS in Systems Engineering, 3.8", "grescores(q,v,w)": "NA", "recommendations": "3 (1 professional, 1 from UIUC, 1 from Oakton)", "experience": "8 years in Data Analytics", "statementofpurpose": "Y", "relevantcreditcourses/moocs": "Python Programming, Java Programming, Data Structures satisfied by credit courses taken at Oakton Community College, Calculus, Linear Algebra, Statistics from prior undergraduate work"}, {"status": "Accepted", "applicationdate": "08/15/2022", "decisiondate": "09/27/2022", "education": "BA in Humanities, 3.24", "grescores(q,v,w)": "0", "recommendations": "1 from work supervisor", "experience": "2 Years, No-name company, ML Engineer", "statementofpurpose": "Explained how I started learning DS, why I think I can succeed in the program, and what I did at work.", "moocs": "8+ including all the math prereqs, ML, data analysis, Python and R.", "comments": "Not really confident about my acceptance. I updated my SOP while the application was \"in review\". I hope the reviewer reads the new one.", "edit": "I'm in! I'm glad that UT Austin has a pretty generous view toward MOOCs and doesn't strictly require \"accredited\" stuff for the prerequisites."}, {"status": "Admitted", "applicationdate": "07/15/22", "decisiondate": "8/23/2022", "education": "Mediocre Private School - Bachelor of Science in Computer Science w/ a Minor in Applied Math GPA 3.42", "grescores(q,v,w)": "0", "recommendations": "0", "experience": "~17 Months Total.", "statementofpurpose": "Talked about how I want to learn Data Science so I can do supply chain optimization using ML.", "moocs": "0"}, {"status": "Accepted", "applicationdate": "08/15/2022", "decisiondate": "09/27/2022", "education": "Tec de Monterrey, BS Biomedical Engineering 3.6", "grescores(q,v,w)": "0", "recommendations": "0", "experience": "Internship at AECULAP as analyst, working as business analyst", "statementofpurpose": "Explain why I want to study this master's degree, my experience and how this experience helps me to obtain the necessary prerequisites to pursue the master's degree. Why I want to study at the University of Texas and what I can contribute to the university.", "moocs": "0"}, {"status": "Rejected", "applicationdate": "08/06/2022", "decisiondate": "10/11/2022", "education": "UT Austin - B.S Mathematics, 3.4 GPA", "grescores(q,v,w)": "N/A", "recommendations": "2 - current manager and past UT math professor", "experience": "2 years as a data analyst for an infrastructure and ops team", "statementofpurpose": "Just explained my professional and educational experiences will help me be prepared for this program and that I would like to learn a deeper, formal learning of data science and its real-world applications", "moocs": "NA"}, {}, {"status": "Accepted", "applicationdate": "9/15/2022", "decisiondate": "10/26/2022", "education": "BS in Civil Engineering, UT Austin, 3.65", "grescores(q,v,w)": "164, 167, 4", "recommendations": "0", "experience": "5 years in transportation/traffic engineering, not DS related", "statementofpurpose": "Talked about my desire to learn data science and apply it to the transportation engineering industry, and the skills that I have that would allow me to succeed in the program.", "moocs": "none"}, {"status": "Rejected", "applicationdate": "Early July/2022", "decisiondate": "Denied (10/27/2022)", "education": "B.A in Mathematics, M.S in Applied Mathematics, Ph.D in Applied Mathematics.", "grescores(q,v,w)": "N/A", "recommendations": "2", "experience": "3 Years (2.5 years at National Lab, 0.5 year as a data scientist at an energy company)", "statementofpurpose": "Explained how my experiences and educations can help me succeed in completing the program, and my long-term career goal is to become a research/data scientist.", "moocs": "Been taking a few ML courses on Coursera", "comments": "I am completely aware that it could be redundant to go for a master degree after having a PhD but I would very much like to have a formal data science/machine learning education."}, {"status": "Rejected", "applicationdate": "08/06/2022", "decisiondate": "10/11/2022", "education": "BBA - management, MBA - Finance GPA: 3.4", "grescores(q,v,w)": "na", "recommendations": "2", "experience": "20+ years in IT and consulting, highly experienced and multiple certifications in cloud computing, data engineering and machine learning", "statementofpurpose": "I wrote about why I wanted to improve my data science skills for personal and professional reasons - gave examples of the types of real world problems I want to solve with data science - explained why my experience sets me up for success in the program despite lackluster performance as undergrad", "moocs": "2 - Linear Algebra and Multivariable Calculus"}, {"status": "Accepted", "applicationdate": "9/15/2022", "decisiondate": "10/26/2022", "education": "Bachelors in Mechanical Engg (3.5), Masters in Industrial engineering (3.70) - Texas A&M University, College Station", "grescores(q,v,w)": "NA", "recommendations": "2", "experience": "Manufacturing Operations and Quality 8 yrs", "statementofpurpose": "Talked about experience working on Stats and related projects. MOOCs to leverage DS learning and get head start. Shared aspirations and goals to be achieved through the degree and domain I am interested to continue in future", "moocs": "Coursera ML Mathematics and Python"}, {"status": "Admitted", "program": "MSDS", "applicationdate": "Before priority deadline", "decisiondate": "28th September", "education": "BTech in IE from IIT Kharagpur", "gre": "NA", "recommendations": "2 Corporate", "experience": "7+ years of exp in Data Science"}, {}, {"status": "Rejected", "program": "MSDS", "applicationdate": "08/15/2023", "decisiondate": "10/6/2023", "education": "Texas A&M - BS Geographic Information Science and Tech 3.45", "grescores(q,v,w)": "N/A", "recommendations": "2 (current and former supervisor)", "experience": "", "2years": "GIS Analyst for O&G Investment Firm", "1year": "Machine Learning Scientist Civil Engineering Firm", "statementofpurpose": "Y", "comments": "2 MOOCs (LAFF and Multivariable Calc)"}, {"status": "In Review", "applicationdate": "9/6/2023", "decisiondate": "", "education": "BA Economics-Mathematics with 2.98 GPA, and 31 semester units of continuing education in CS + stats with a 3.9 GPA", "grescores(q,v,w)": "N/A", "recommendations": "Two (current and former managers)", "experience": "5 years in marketing analytics and automation. Lots of experience in Python, data pipelines, production ML models, and a little bit of LLM stuff", "statementofpurpose": "Described my academic history, strong performance in math+stats+CS, career achievements in data, and how I've improved my career through online studies before", "comments": "Since my bachelors GPA is 2.98 I wrote a supplemental doc to explain my continued education since then. My cumulative undergraduate GPA now stands at 3.2. In all math, statistics, computer science, and analytics coursework, I have a 3.48 GPA."}, {}, {"status": "In review\nProgram: MSDS\nApplication Date: 08/13/2023\nDecision Date: In Review\nEducation: Mid-Size State School - BS in Mathematics (3.9/4.0), BA in Psychology (3.92/4.00), Overall GPA 3.82/4.0 - Graduating December 2023\nGRE Scores (Q,V,W): 162, 162, 4.0\nRecommendations: 2 Professors I RA'd for\nExperience:", "1researchfellowship\nstatementofpurpose": "Y - talked about why I need a MS in DS to achieve my future goals, pointed out specific classes in the curriculum I think would be useful, discussed how my research experience makes me a good fit.\nComments: I do not have much Programming Experience. I am currently taking UMICH Python Specialization, then will take Python for Data Science Course before ~hopefully~ enrolling to UT's MSDS. If anyone could recommend other online courses specific to R, that would be much appreciated!"}, {"status": "Admitted", "program": "MSDS", "applicationdate": "9/8/23", "decisiondate": "10/4/23", "education": "Industrial Engineering, Texas State University", "grescores(q,v,w)": "N/ARecommendations: 1 academic, 2 professional", "experience": "Business analyst, data analyst, engineering experience", "statementofpurpose": "talked about how my interest in data and data science started", "comments": "Met all the math pre-reqs but only 1 coding class ( C++)"}, {"status": "Admitted", "applicationdate": "8/15/2023", "decisiondate": "10/4/2023", "education": "BS Mathematics with 2.97 GPA", "grescores": "N/A", "recommendations": "One (current manager)", "experience": "2 years in fintech, 4 years in marketing analytics and 6 months as a data scientist. Lots of experience in Python, stats, and just starting out with LLMs", "statementofpurpose": "Described academic background and how my career progression has been steadily moving towards DS. I’d say the essay itself was very well written as I needed to up my app given my low undergrad gpa"}, {"status": "Accepted", "program": "MSDS", "applicationdate": "16 August 2023", "decisiondate": "4 Oct 2023", "education": "BE Electrical and Electronics , Anna University, India.", "grescores(q,v,w)": "None", "recommendations": "None", "experience": "9 years of experience in Manufacturing Industry.", "statementofpurpose": "Ellaborated on importance and how data analytics helped me in my work.", "comments": "Completed a certification program in Data Science and Business Analytics."}, {"status": "In Review", "program": "MSDS", "applicationdate": "8/13/23", "decisiondate": "Waiting", "education": "Texas A&M University - BS Electrical Engineering 3.53", "grescores(q,v,w)": "N/A", "recommendation": "1 (current supervisor)", "experience": "1 year as a Digital Design Engineer, Python internship, NLP Capstone Project", "statementofpurpose": "Y", "comments": "2 MOOCs, mentioned them in my SoP, (Google Cybersecurity and Machine Learning Specialization)"}]